---
kind: method
id: M:Autodesk.Revit.DB.WallSweepInfo.Dispose
source: html/0e25ba79-4f5d-0ada-ae8b-dc9dc9003b8f.htm
---
# Autodesk.Revit.DB.WallSweepInfo.Dispose Method

Releases all resources used by the WallSweepInfo

## Syntax (C#)
```csharp
public void Dispose()
```